# -*- coding: utf-8 -*-

activities_to_project = {
    # activities of u"2015CyberMARS產品研發專案"
    "產品解決方案論證 <<1.2.1>>"                 : u"2015CyberMARS產品研發專案",
    "產品規劃_如roadmap與whitepaper等 <<1.2.2>>" : u"2015CyberMARS產品研發專案",
    "管理事務_如時程,資源規劃與管理等 <<1.2.3>>" : u"2015CyberMARS產品研發專案",
    "專案進度會議 <<1.2.4>>"                   : u"2015CyberMARS產品研發專案",
    "設計文件撰寫 <<1.4.1>>"                   : u"2015CyberMARS產品研發專案",
    "Code Review <<1.4.3>>"                    : u"2015CyberMARS產品研發專案",
    "產品程式開發 <<1.4.4>>"                   : u"2015CyberMARS產品研發專案",
    "單元測試程式開發 <<1.4.6>>"               : u"2015CyberMARS產品研發專案",
    "執行測試 <<1.4.7>>"                       : u"2015CyberMARS產品研發專案",
    "Bug修復 <<1.4.8>>"                        : u"2015CyberMARS產品研發專案",
    "品質保證 <<1.5>>"                         : u"2015CyberMARS產品研發專案",
    "測試環境建置 <<1.5.1>>"                   : u"2015CyberMARS產品研發專案",
    "測試系統設定 <<1.5.2>>"                   : u"2015CyberMARS產品研發專案",
    "測試案例撰寫 <<1.5.4>>"                   : u"2015CyberMARS產品研發專案",
    "測試案例執行 <<1.5.5>>"                   : u"2015CyberMARS產品研發專案",
    "自動化測試程式或工具準備與撰寫 <<1.5.6>>"   : u"2015CyberMARS產品研發專案",
    "Bug重現 <<1.5.7>>"                       : u"2015CyberMARS產品研發專案",
    "測試報告撰寫 <<1.5.8>>"                   : u"2015CyberMARS產品研發專案",
    "Bug驗證 <<1.5.9>>"                       : u"2015CyberMARS產品研發專案",

    # activities of '2017_SDD'
    "差旅 <<1.1.1>>"                                     : '2017_SDD',
    "學習成長(自我研讀、參加教育訓練) <<1.1.1>>"            : '2017_SDD',
    "服務支援(同事間備援、跨部門/處支援) <<1.1.2>>"         : '2017_SDD',
    "會議(內/外部會議) <<1.1.3>>"                         : '2017_SDD',
    "休假 <<1.1.4>>"                                     : '2017_SDD',
    "公司活動(參加員工大會等公司活動) <<1.1.5>>"            : '2017_SDD',
    "行政庶務(準備及撰寫文件、 一般行政或庶務) <<1.1.6>>"    : '2017_SDD',
    "溝通協調(部門或跨部門溝通協調) <<1.1.7>>"              : '2017_SDD'
}