# -*- coding: utf-8 -*-

activities_to_project = {
    # activities of u"2015CyberMARS產品研發專案"
    "管理事務_如時程,資源規劃與管理等 <<1.2.3>>" : u"2015CyberMARS產品研發專案",
    "專案進度會議 <<1.2.4>>"                   : u"2015CyberMARS產品研發專案",
    "測試環境建置 <<1.5.1>>"                   : u"2015CyberMARS產品研發專案",
    "測試系統設定 <<1.5.2>>"                   : u"2015CyberMARS產品研發專案",
    "測試文件撰寫 <<1.5.3>>"                   : u"2015CyberMARS產品研發專案",
    "測試案例撰寫 <<1.5.4>>"                   : u"2015CyberMARS產品研發專案",
    "測試案例執行 <<1.5.5>>"                   : u"2015CyberMARS產品研發專案",
    "自動化測試程式或工具準備與撰寫 <<1.5.6>>"   : u"2015CyberMARS產品研發專案",
    "Bug重現 <<1.5.7>>"                       : u"2015CyberMARS產品研發專案",
    "測試報告撰寫 <<1.5.8>>"                   : u"2015CyberMARS產品研發專案",
    "Bug驗證 <<1.5.9>>"                       : u"2015CyberMARS產品研發專案",
    "產品文件與相關資料收集 <<1.5.10>>"         : u"2015CyberMARS產品研發專案",

    # activities of '2016Y_SDD'
    "差旅 <<1.1.1>>"                                     : '2016Y_SDD',
    "學習成長(自我研讀、參加敎育訓練) <<1.1.2>>"            : '2016Y_SDD',
    "服務支援(同事間備援、跨部門/處支援) <<1.1.3>>"         : '2016Y_SDD',
    "會議(內/外部會議) <<1.1.4>>"                         : '2016Y_SDD',
    "休假 <<1.1.5>>"                                     : '2016Y_SDD',
    "公司活動(參加員工大會等公司活動) <<1.1.6>>"            : '2016Y_SDD',
    "行政庶務(準備及撰寫文件、 一般行政或庶務) <<1.1.7>>"    : '2016Y_SDD',
    "溝通協調(部門或跨部門溝通協調) <<1.1.8>>"              : '2016Y_SDD'
}